app/Controllers/Home.php

SELECT *
FROM `post`
ORDER BY `likes` DESC, `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `post`
---
	public function index()
	{
		return view('home/index', [
			"posts" => $this->model->orderBy("likes", "DESC")->orderBy("created_at", "DESC")->paginate(5),
			// "pager" => $this->model->pager,
			"controller" => $this
		]);

SELECT *
FROM `user`
WHERE `user`.`id` = '2'
---
	public function getUserById($id)
	{
		$userModel = new UserModel;
		$user = $userModel->find($id);