app/Controllers/Posts.php

SELECT *
FROM `post`
ORDER BY `likes` DESC, `created_at` DESC
 LIMIT 3, 3
SELECT COUNT(*) AS `numrows`
FROM `post`
---
    public function index()
    {
        // $posts =  $this->model->getUserPosts($this->user_id);
        return view('posts/index', [
            "posts" => $this->model->orderBy("likes", "DESC")->orderBy("created_at", "DESC")->paginate(3),
            "pager" => $this->model->pager,
            "controller" => $this
        ]);

UPDATE `post` SET `likes` = 516, `updated_at` = '2024-02-29 22:15:01'
WHERE `post`.`id` IN ('6')
---
    public function likePost($id)
    {
        // Find the post by its ID
        $post = $this->model->find($id);
        print_r($post);
        if (!$post) {
            return redirect()->back()->with('error', 'Post not found');
        }
        else{
            $likes = $post->likes + 1;
            $post->likes = $likes;
            $this->model->save($post);

UPDATE `post` SET `description` = 'GPUs can be used for video editing, 3D graphics rendering, and much more. With a high processing throughput, GPUs can process more data than their Central Processing Unit (CPU) counterparts, making them uniquely suited for highly demanding tasks such as machine learning and Cryptocurrency mining. \r\nGPUs are used in professional applications such as CAD drawing, video editing, product walkthroughs and interactivity, medical imagery, and seismic imaging. They are also applied to other complex image and video editing and visualization applications.', `updated_at` = '2024-02-29 22:14:20'
WHERE `post`.`id` IN ('18')
---
    public function update($id)
    {
        $post = $this->model->find($id);
        $post->fill($this->request->getPost());
        if ($post->user_id === session("user_id")) {
            if ($post->hasChanged('title') || $post->hasChanged('description')) {
                if ($this->model->save($post)) {

DELETE FROM `post`
WHERE `id` IN ('18')
---
    public function delete($id)
    {
        $post = $this->model->find($id);

        if (!$post) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Article $id not found !");
        }


        if ($post->user_id === session("user_id")) {
            $this->model->delete($id);

SELECT *
FROM `user`
WHERE `user`.`id` = '2'
---
    public function getUserById($id)
    {
        $userModel = new UserModel;
        $user = $userModel->find($id);