app/Controllers/Profile.php

    public function __construct()
    {
        $this->model = new UserModel;
        $this->user = $this->model->find(session("user_id"));
---
SELECT *
FROM `user`
WHERE `user`.`id` = '4'